{
    "pastJobs" : [
             {
                    "name" : "Researcher",
                    "company": "Malawi University of Business and Applied Sciences",
                    "details": "Contributing to research at the AI Lab, including ideation, field research, and stakeholder collaboration. Key achievement: Created a dataset for computer vision-based natural disaster damage classification and building detection, which involved annotating pre-disaster and post-disaster images and building a model to test the dataset. Our dataset is part of the Zindi Africa Challenge( won first place). The challenge can be accessed <a href='https://zindi.africa/competitions/kuyesera-ai-disaster-damage-and-displacement-challenge/data'>here</a>",
                    "period" : "May 2024 - Present"
                },
                {
                    "name" : "Teaching Assistant",
                    "company": "UC Berkeley, Blum Center for Developing Economies",
                    "details": "Teaching Assistant for the Digital Transformation for Global Development course. Responsibilities include tutoring students in data manipulation using R and Python, grading assignments written in these languages, and configuring CircuitPy microcontrollers.",
                    "period" : "January 2024 - Present"
                },
                {
                    "name" : "Teaching Assistant",
                    "company": "UC Berkeley, Department of Chemistry",
                    "details": "In this role, I tutored students in software engineering practices using C++, graded assignments, and organized and collaborated on online classes.",
                    "period" : "September 2023 - December 2023"
                },

             {
                    "name" : "Solutions Architect",
                    "company": "NBS Bank Plc",
                    "details": "Coming up with software architecture for all projects and ensuring that all projects are adhering to the Enterprise Architecture. The role also includes leading a team of developers; coaching, mentorship and ensuring projects are delivered on time.",
                    "period" : "October 31 2022 - August 12 2023"
            },
            {
                "name" : "Digital Transformation Lead",
                "company": "NICO Group",
                "details": "I took a leading role in the NICO Group Digital Innovation Centre of Excellence, responsible for developing digital transformation strategies for NICO Group entities including NBS Bank Plc, NICO Technologies, and NICO Life Pensions.",
                "period" : "November 2022 - August 2023"
            },
            {
                "name" : "Cloud Migration Technical Lead",
                "company": "NBS Bank Plc",
                "details": "Led the cloud migration project at NBS Bank Plc by providing technical input and designing a scalable, flexible architecture that adheres to modern software development standards. Also played a key role in formulating and implementing the bank's cloud migration strategy.",
                "period" : "January 2023 - August 2023"
            },
            {
                    "name" : "Solutions Architect",
                    "company": "NBS Bank Plc",
                    "details": "Coming up with software architecture for all projects and ensuring that all projects are adhering to the Enterprise Architecture. The role also includes leading a team of developers; coaching, mentorship and ensuring projects are delivered on time.",
                    "period" : "October 31 2022 - August 12 2023"
            },
            {
                "name" : "Solutions Developer",
                "company": "NBS Bank Plc",
                "details": "Responsible for integrating third party services with the Core Banking Systems. Also responsible for developing platforms for bank users to interact with the bank's financial services",
                "period" : "October 6 2018 - October 31 2022"
            },
            {
                "name" : "Senior Software Engineer",
                "company": "NITEL",
                "details": "Responsible for developing services for the company's clients and leading a team of developers.",
                "period" : "September 8 2018 - October 6 2018"
            },
            {
                "name" : "Part-Time Lecturer in Computer Programming",
                "company": "MUBAS",
                "details": "Worked as a part-time lecturer teaching C++ programming. Responsibilities included preparing and delivering lectures, as well as marking and grading student papers.",
                "period" : "September 2017 - February 2018"
            },
                {
            "name" : "Founder",
            "company": "Technify Malawi Program",
            "details": "Founded an initiative aimed at increasing access to ICT for underprivileged youths by mobilizing and donating computers to secondary schools. Key achievements: Donated computers to St Martin Open Day Secondary School, which helped the school introduce computer studies and reduce absenteeism. Also donated computers to Neno Girls Secondary School.",
            "period" : "August 2018 - Present"
        }

     
  ]
}
